/**********************************************************************************/  
/*  Problem: a003 "兩光法師占卜術"                                         */  
/*  Language: C                                                                   */  
/*  Result: AC (3ms, 245KB) on ZeroJudge                                          */  
/*  Author: chchwy at 2009-11-10 10:42:05                                         */  
/**********************************************************************************/  
  
#include<stdio.h>  
  
int main(){  
	int M,D;  
	char buf[3][12] = {"普通","吉","大吉"};  
	while(scanf("%d %d ", &M, &D )==2 )  
	{  
		puts( buf[ (M*2+D)%3 ]);  
	}      
	return 0;  
}