/**********************************************************************************/  
/*  Problem: d051 "糟糕，我發燒了！" from 板橋高中                    */  
/*  Language: C++                                                                 */  
/*  Result: AC (4ms, 756KB) on ZeroJudge                                          */  
/*  Author: chchwy at 2009-11-10 20:04:54                                         */  
/**********************************************************************************/  
  
#include<iostream>  
  
int main(){  
    double w,c;  
    while(scanf("%lf",&c)==1)
        printf("%.3lf\n", (c-32.0)*(5.0/9.0) );  
    return 0;  
}