/**********************************************************************************/  
/*  Problem: d060 "還要等多久啊？" from 板橋高中                       */  
/*  Language: C++                                                                 */  
/*  Result: AC (4ms, 716KB) on ZeroJudge                                          */  
/*  Author: chchwy at 2009-11-11 20:02:39                                         */  
/**********************************************************************************/  
  
#include<iostream>  
int main(){  
	int min;  
	while(scanf("%d ", &min)==1)  
		printf("%d\n", (25+60-min)%60 );  
	return 0;  
}