/**********************************************************************************/
/*  Problem: d063 "0 與 1" from 板橋高中                                     */
/*  Language: C++                                                                 */
/*  Result: AC (6ms, 720KB) on ZeroJudge                                          */
/*  Author: chchwy at 2009-11-11 20:05:37                                         */
/**********************************************************************************/
#include<iostream>
int main()
{
    int a;
    while (scanf("%d ", &a) == 1) printf("%d\n", !a);
}