/**********************************************************************************/  
/*  Problem: d461 "班際籃球賽" from 板橋高中                             */  
/*  Language: C++                                                                 */  
/*  Result: AC (3ms, 714KB) on ZeroJudge                                          */  
/*  Author: chchwy at 2009-11-18 19:13:19                                         */  
/**********************************************************************************/  
  
#include<iostream>  
  
int main(){  
    int num;  
    while( scanf("%d", &num)==1 ){  
        printf("%d\n", num-1 );  
    }  
}