/**********************************************************************************/  
/*  Problem: d490 "我也愛偶數" from 板橋高中                             */  
/*  Language: C++                                                                 */  
/*  Result: AC (4ms, 719KB) on ZeroJudge                                          */  
/*  Author: chchwy at 2009-11-18 19:27:20                                         */  
/**********************************************************************************/  
  
#include<iostream>  
  
int main(){  
	int a,b;  
	while(scanf("%d %d", &a, &b)==2){  
		if(a%2) a++;  
		if(b%2) b--;  
		  
		printf("%d\n", (a+b)*((b-a)/2+1)/2 );  
	}  
} 